app/Models/AuthModel.php

    public function checkData($username, $password)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengguna');
        return $builder->getWhere([
            'username' => $username,
            'password' => $password
        ])->getRow();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'dasdas'
AND `password` = '85136c79cbf9fe36bb9d05d0639c70c265c18d37'